app/controllers/colleges_controller.rb

	def index
	  	@colleges = College.all
---
SELECT "colleges".* FROM "colleges"

	def listing
		gaga = College.find(params[:format])
---
SELECT "colleges".* FROM "colleges" WHERE "colleges"."id" = ? LIMIT 1  [["id", "4"]]